Repository: Robert-Rzezniczek/SIProjekt
Catalog: translations/validators.*.xlf
Languages: pl

# message.this_email_already_exists
source: There is already an account with this email.
pl: Istnieje już konto z tym emailem.

# message.max_characters_is_50
source: The maximum length is 50 characters.
pl: Maksymalna długość to 50 znaków.

# message.you_should_agree
source: You must agree to the terms.
pl: Musisz zaakceptować warunki.

# message.enter_password
source: Please enter a password.
pl: Proszę wprowadzić hasło.

# message.password_too_short
source: Password is too short. It must be at least 6 characters.
pl: Hasło jest za krótkie. Musi mieć co najmniej 6 znaków.

# message.password_not_blank
source: Password cannot be blank.
pl: Hasło nie może być puste.

# message.password_must_contain_letter_and_number
source: Password must contain at least one letter and one number.
pl: Hasło musi zawierać co najmniej jedną literę i jedną cyfrę.

# message.email_not_blank
source: Email cannot be blank.
pl: Email nie może być pusty.

# message.invalid_email_format
source: Invalid email format.
pl: Nieprawidłowy format emaila.

# message.email_too_short
source: Email is too short.
pl: Email jest za krótki.

# message.nickname_too_long
source: Nickname is too long. Maximum 50 characters.
pl: Pseudonim jest za długi. Maksimum 50 znaków.
